# CHAPTER 2 . 단일행 함수
****

### 2-1. 문자함수
### < UPPER, LOWER, INITCAP >

In [1]:
import cx_Oracle
import pandas as pd
xedb = cx_Oracle.connect('hr/hr@localhost/xe')
cur = xedb.cursor()

In [2]:
df = pd.read_sql("""
                 SELECT 'The job id for '||UPPER(last_name)||' is ' ||INITCAP(job_id) as EMP
                 FROM employees
                 """, xedb)
print(df)

                                       EMP
0            The job id for ABEL is Sa_Rep
1            The job id for ANDE is Sa_Rep
2      The job id for ATKINSON is St_Clerk
3         The job id for AUSTIN is It_Prog
4            The job id for BAER is Pr_Rep
5         The job id for BAIDA is Pu_Clerk
6           The job id for BANDA is Sa_Rep
7           The job id for BATES is Sa_Rep
8          The job id for BELL is Sh_Clerk
9       The job id for BERNSTEIN is Sa_Rep
10       The job id for BISSOT is St_Clerk
11          The job id for BLOOM is Sa_Rep
12         The job id for BULL is Sh_Clerk
13       The job id for CABRIO is Sh_Clerk
14      The job id for CAMBRAULT is Sa_Man
15      The job id for CAMBRAULT is Sa_Rep
16       The job id for CHEN is Fi_Account
17        The job id for CHUNG is Sh_Clerk
18   The job id for COLMENARES is Pu_Clerk
19       The job id for DAVIES is St_Clerk
20         The job id for DE HAAN is Ad_Vp
21    The job id for DELLINGER is Sh_Clerk
22        The job id for DILLY is Sh_Clerk
23          The job id for DORAN is Sa_Rep
24         The job id for ERNST is It_Prog
25      The job id for ERRAZURIZ is Sa_Man
26      The job id for EVERETT is Sh_Clerk
27     The job id for FAVIET is Fi_Account
28            The job id for FAY is Mk_Rep
29       The job id for FEENEY is Sh_Clerk
..                                     ...
77        The job id for PATEL is St_Clerk
78      The job id for PERKINS is Sh_Clerk
79   The job id for PHILTANKER is St_Clerk
80       The job id for POPP is Fi_Account
81         The job id for RAJS is St_Clerk
82       The job id for RAPHAELY is Pu_Man
83       The job id for ROGERS is St_Clerk
84        The job id for RUSSELL is Sa_Man
85     The job id for SARCHAND is Sh_Clerk
86    The job id for SCIARRA is Fi_Account
87          The job id for SEO is St_Clerk
88         The job id for SEWALL is Sa_Rep
89          The job id for SMITH is Sa_Rep
90          The job id for SMITH is Sa_Rep
91       The job id for STILES is St_Clerk
92     The job id for SULLIVAN is Sh_Clerk
93          The job id for SULLY is Sa_Rep
94         The job id for TAYLOR is Sa_Rep
95       The job id for TAYLOR is Sh_Clerk
96       The job id for TOBIAS is Pu_Clerk
97         The job id for TUCKER is Sa_Rep
98        The job id for TUVAULT is Sa_Rep
99      The job id for URMAN is Fi_Account
100      The job id for VARGAS is St_Clerk
101       The job id for VISHNEY is Sa_Rep
102       The job id for VOLLMAN is St_Man
103       The job id for WALSH is Sh_Clerk
104         The job id for WEISS is St_Man
105       The job id for WHALEN is Ad_Asst
106       The job id for ZLOTKEY is Sa_Man

[107 rows x 1 columns]

In [3]:
df = pd.read_sql("""
                 SELECT employee_id, last_name, department_id
                 FROM employees
                 WHERE lower(last_name)='higgins'
                 """,xedb)
print(df)

   EMPLOYEE_ID LAST_NAME  DEPARTMENT_ID
0          205   Higgins            110

### < CONCAT, LENGTH, INSTR, SUBSTR >
* CONCAT : 문자연결
* LENGTH : 문자길이
* INSTR : 문자위치정보
* SUBSTR : 문자를 잘라 추출

In [4]:
df = pd.read_sql("""
                 SELECT job_id, concat(first_name,last_name) NAME, LENGTH(last_name), instr(last_name,'a')
                 FROM employees
                 WHERE substr(job_id,4,3)='REP'
                 """,xedb)
print(df)

    JOB_ID              NAME  LENGTH(LAST_NAME)  INSTR(LAST_NAME,'A')
0   HR_REP       SusanMavris                  6                     2
1   MK_REP            PatFay                  3                     2
2   PR_REP       HermannBaer                  4                     2
3   SA_REP       PeterTucker                  6                     0
4   SA_REP    DavidBernstein                  9                     0
5   SA_REP         PeterHall                  4                     2
6   SA_REP  ChristopherOlsen                  5                     0
7   SA_REP  NanetteCambrault                  9                     2
8   SA_REP     OliverTuvault                  7                     4
9   SA_REP       JanetteKing                  4                     0
10  SA_REP      PatrickSully                  5                     0
11  SA_REP       AllanMcEwen                  6                     0
12  SA_REP      LindseySmith                  5                     0
13  SA_REP       LouiseDoran                  5                     4
14  SA_REP      SarathSewall                  6                     4
15  SA_REP      ClaraVishney                  7                     0
16  SA_REP    DanielleGreene                  6                     0
17  SA_REP     MatteaMarvins                  7                     2
18  SA_REP          DavidLee                  3                     0
19  SA_REP        SundarAnde                  4                     0
20  SA_REP         AmitBanda                  5                     2
21  SA_REP          LisaOzer                  4                     0
22  SA_REP     HarrisonBloom                  5                     0
23  SA_REP         TaylerFox                  3                     0
24  SA_REP      WilliamSmith                  5                     0
25  SA_REP    ElizabethBates                  5                     2
26  SA_REP      SunditaKumar                  5                     4
27  SA_REP         EllenAbel                  4                     0
28  SA_REP      AlyssaHutton                  6                     0
29  SA_REP    JonathonTaylor                  6                     2
30  SA_REP    JackLivingston                 10                     0
31  SA_REP    KimberelyGrant                  5                     3
32  SA_REP    CharlesJohnson                  7                     0

### < LPAD, RPAD >

In [6]:
df = pd.read_sql("""
                 SELECT salary, lpad(salary,10,'*') AS lp, rpad(salary,10,'*') AS rp
                 FROM employees
                 WHERE salary>10000
                 """,xedb)
print(df)

     SALARY          LP          RP
0   24000.0  *****24000  24000*****
1   17000.0  *****17000  17000*****
2   17000.0  *****17000  17000*****
3   12008.0  *****12008  12008*****
4   11000.0  *****11000  11000*****
5   14000.0  *****14000  14000*****
6   13500.0  *****13500  13500*****
7   12000.0  *****12000  12000*****
8   11000.0  *****11000  11000*****
9   10500.0  *****10500  10500*****
10  10500.0  *****10500  10500*****
11  11500.0  *****11500  11500*****
12  11000.0  *****11000  11000*****
13  13000.0  *****13000  13000*****
14  12008.0  *****12008  12008*****

### < TRIM, RTRIM, LTRIM >
특정문자제거

In [7]:
df = pd.read_sql("""
                 SELECT trim('A' FROM 'AABBCAA')t, 
                         rtrim('BBCAA','A')rt, 
                         ltrim('AABBC','A')lt
                 FROM dual
                 """,xedb)
print(df)

     T   RT   LT
0  BBC  BBC  BBC

In [8]:
df = pd.read_sql("""
                 SELECT trim('A' from 'AABBCAA')t, 
                         rtrim('AABBCAA','A')rt, 
                         ltrim('AAAAA','A')lt
                 FROM dual
                 """,xedb)
print(df)

     T     RT    LT
0  BBC  AABBC  None

### < REPLACE >
특정문자 변경

In [9]:
df = pd.read_sql("""
                 SELECT REPLACE('010-1234-5678','-','') phone
                 FROM dual
                 """,xedb)
print(df)

         PHONE
0  01012345678

In [10]:
df = pd.read_sql("""
                 SELECT replace('010-1234-5678','010','8210') phone
                 FROM dual
                 """,xedb)
print(df)

            PHONE
0  8210-1234-5678

***
### 2-2 숫자함수
### < ROUND, TRUNC, MOD >

In [13]:
df = pd.read_sql("""
                 SELECT round(45.926,0), round(45.926,2), round(45.926,-1)
                 FROM dual
                 """,xedb)
print(df)

   ROUND(45.926,0)  ROUND(45.926,2)  ROUND(45.926,-1)
0               46            45.93                50

In [14]:
df = pd.read_sql("""
                 SELECT trunc(45.926,2), trunc(45.926), trunc(45.926,-1)
                 FROM dual
                 """,xedb)
print(df)

   TRUNC(45.926,2)  TRUNC(45.926)  TRUNC(45.926,-1)
0            45.92             45                40

In [16]:
df = pd.read_sql("""
                 SELECT salary, mod(salary, 10000) mod_sal
                 FROM employees
                 WHERE salary>=10000
                 """,xedb)
print(df)

     SALARY  MOD_SAL
0   24000.0     4000
1   17000.0     7000
2   17000.0     7000
3   12008.0     2008
4   11000.0     1000
5   14000.0     4000
6   13500.0     3500
7   12000.0     2000
8   11000.0     1000
9   10500.0      500
10  10000.0        0
11  10000.0        0
12  10500.0      500
13  11500.0     1500
14  10000.0        0
15  11000.0     1000
16  13000.0     3000
17  10000.0        0
18  12008.0     2008

***
### 2-3 날짜함수
* date + number = date
* date - number = date
* date - date = number
* date + date = error
* date + 10/24 = date

- 10hours : 10/24
- 10minutes : 10/24*60
- 10seconds : 10/24* 60* 60

### < MONTHS_BETWEEN, ADD_MONTHS, NEXT_DAY, LAST_DAY >

In [17]:
df = pd.read_sql("""
                 SELECT hire_date,
                        trunc(months_between (SYSDATE, hire_date)) months_between,
                        add_months(hire_date, 6) add_months,
                        next_day (hire_date,'금요일') next_day,
                        last_day(hire_date) last_day
                FROM employees
                WHERE salary >10000
                """,xedb)
print(df)

    HIRE_DATE  MONTHS_BETWEEN ADD_MONTHS   NEXT_DAY   LAST_DAY
0  2003-06-17             172 2003-12-17 2003-06-20 2003-06-30
1  2005-09-21             145 2006-03-21 2005-09-23 2005-09-30
2  2001-01-13             202 2001-07-13 2001-01-19 2001-01-31
3  2002-08-17             182 2003-02-17 2002-08-23 2002-08-31
4  2002-12-07             179 2003-06-07 2002-12-13 2002-12-31
5  2004-10-01             157 2005-04-01 2004-10-08 2004-10-31
6  2005-01-05             154 2005-07-05 2005-01-07 2005-01-31
7  2005-03-10             152 2005-09-10 2005-03-11 2005-03-31
8  2007-10-15             120 2008-04-15 2007-10-19 2007-10-31
9  2008-01-29             117 2008-07-29 2008-02-01 2008-01-31
10 2005-11-11             144 2006-05-11 2005-11-18 2005-11-30
11 2005-03-11             152 2005-09-11 2005-03-18 2005-03-31
12 2004-05-11             162 2004-11-11 2004-05-14 2004-05-31
13 2004-02-17             164 2004-08-17 2004-02-20 2004-02-29
14 2002-06-07             185 2002-12-07 2002-06-14 2002-06-30

### < ROUND, TRUNC >

In [18]:
df = pd.read_sql("""
                 SELECT SYSDATE,
                        round(SYSDATE, 'MONTH') round_mon,
                        round(SYSDATE, 'YEAR') round_yr,
                        trunc (SYSDATE, 'MONTH') trunc_mon,
                        trunc(SYSDATE, 'YEAR') trunc_yr
                FROM dual
                """,xedb)
print(df)

              SYSDATE  ROUND_MON   ROUND_YR  TRUNC_MON   TRUNC_YR
0 2017-11-13 11:45:49 2017-11-01 2018-01-01 2017-11-01 2017-01-01

### < EXTRACT >

In [20]:
df = pd.read_sql("""
                 SELECT last_name, hire_date,
                        EXTRACT(YEAR FROM hire_date) yr,
                        EXTRACT(MONTH FROM hire_date) mon
                FROM employees
                WHERE salary >10000
                """,xedb)
print(df)

    LAST_NAME  HIRE_DATE    YR  MON
0        King 2003-06-17  2003    6
1     Kochhar 2005-09-21  2005    9
2     De Haan 2001-01-13  2001    1
3   Greenberg 2002-08-17  2002    8
4    Raphaely 2002-12-07  2002   12
5     Russell 2004-10-01  2004   10
6    Partners 2005-01-05  2005    1
7   Errazuriz 2005-03-10  2005    3
8   Cambrault 2007-10-15  2007   10
9     Zlotkey 2008-01-29  2008    1
10    Vishney 2005-11-11  2005   11
11       Ozer 2005-03-11  2005    3
12       Abel 2004-05-11  2004    5
13  Hartstein 2004-02-17  2004    2
14    Higgins 2002-06-07  2002    6

### 2-4 변환함수
### < TO_CHAR, TO_NUMBER, TO_DATE >

In [21]:
df = pd.read_sql("""
                 SELECT hire_date,to_date('2005-01-01','yyyy-mm-dd') DATE_,to_char(hire_date,'yyyy-mm-dd') CHAR_
                 FROM employees
                 WHERE salary>15000
                 """,xedb)
print(df)

   HIRE_DATE      DATE_       CHAR_
0 2003-06-17 2005-01-01  2003-06-17
1 2005-09-21 2005-01-01  2005-09-21
2 2001-01-13 2005-01-01  2001-01-13

In [22]:
df = pd.read_sql("""
                 SELECT hire_date, to_char(hire_date, 'DDD DD D') DDD_DD_D
                 FROM employees
                 WHERE salary>10000
                 """,xedb)
print(df)

    HIRE_DATE  DDD_DD_D
0  2003-06-17  168 17 3
1  2005-09-21  264 21 4
2  2001-01-13  013 13 7
3  2002-08-17  229 17 7
4  2002-12-07  341 07 7
5  2004-10-01  275 01 6
6  2005-01-05  005 05 4
7  2005-03-10  069 10 5
8  2007-10-15  288 15 2
9  2008-01-29  029 29 3
10 2005-11-11  315 11 6
11 2005-03-11  070 11 6
12 2004-05-11  132 11 3
13 2004-02-17  048 17 3
14 2002-06-07  158 07 6

In [23]:
df = pd.read_sql("""
                 SELECT hire_date,to_char(hire_date, 'D')d, to_char(hire_date, 'DAY')DAY
                 FROM employees
                 WHERE salary>10000
                 """,xedb)
print(df)

## sun:1, mon:2, tue:3, wed:4, thu:4, fri:6, sat:7

    HIRE_DATE  D  DAY
0  2003-06-17  3  화요일
1  2005-09-21  4  수요일
2  2001-01-13  7  토요일
3  2002-08-17  7  토요일
4  2002-12-07  7  토요일
5  2004-10-01  6  금요일
6  2005-01-05  4  수요일
7  2005-03-10  5  목요일
8  2007-10-15  2  월요일
9  2008-01-29  3  화요일
10 2005-11-11  6  금요일
11 2005-03-11  6  금요일
12 2004-05-11  3  화요일
13 2004-02-17  3  화요일
14 2002-06-07  6  금요일

In [24]:
df = pd.read_sql("""
                 SELECT hire_date, to_char(hire_date, 'D')d, to_char(hire_date, 'DAY')DAY
                 FROM employees
                 WHERE salary>10000
                 ORDER BY to_char(hire_date-1,'D')
                 """,xedb)
print(df)

    HIRE_DATE  D  DAY
0  2007-10-15  2  월요일
1  2003-06-17  3  화요일
2  2004-02-17  3  화요일
3  2004-05-11  3  화요일
4  2008-01-29  3  화요일
5  2005-09-21  4  수요일
6  2005-01-05  4  수요일
7  2005-03-10  5  목요일
8  2005-11-11  6  금요일
9  2005-03-11  6  금요일
10 2002-06-07  6  금요일
11 2004-10-01  6  금요일
12 2002-12-07  7  토요일
13 2002-08-17  7  토요일
14 2001-01-13  7  토요일

### < 통화단위 >

In [25]:
df = pd.read_sql("""
                 SELECT salary, to_char(salary, 'L00,000.00')L, to_char(salary,'$99,999.00')D
                 FROM employees
                 WHERE salary<3000
                 """,xedb)
print(df)

#0은 앞의 빈자리를 0으로 채움 / 9는 일반적 표기방식 (없으면 표기하지 않는다)

    SALARY                   L            D
0   2900.0          ￦02,900.00    $2,900.00
1   2800.0          ￦02,800.00    $2,800.00
2   2600.0          ￦02,600.00    $2,600.00
3   2500.0          ￦02,500.00    $2,500.00
4   2700.0          ￦02,700.00    $2,700.00
5   2400.0          ￦02,400.00    $2,400.00
6   2200.0          ￦02,200.00    $2,200.00
7   2800.0          ￦02,800.00    $2,800.00
8   2500.0          ￦02,500.00    $2,500.00
9   2100.0          ￦02,100.00    $2,100.00
10  2900.0          ￦02,900.00    $2,900.00
11  2400.0          ￦02,400.00    $2,400.00
12  2200.0          ￦02,200.00    $2,200.00
13  2700.0          ￦02,700.00    $2,700.00
14  2500.0          ￦02,500.00    $2,500.00
15  2600.0          ￦02,600.00    $2,600.00
16  2500.0          ￦02,500.00    $2,500.00
17  2500.0          ￦02,500.00    $2,500.00
18  2800.0          ￦02,800.00    $2,800.00
19  2900.0          ￦02,900.00    $2,900.00
20  2500.0          ￦02,500.00    $2,500.00
21  2800.0          ￦02,800.00    $2,800.00
22  2600.0          ￦02,600.00    $2,600.00
23  2600.0          ￦02,600.00    $2,600.00

### < TIMESTAMP >
* timestamp                   날짜타입(초이하 9자리) 6자리~최대9자리
* timestamp with time zone    client(한국, +9:00) 와 server(싱가폴, +8:00)에서 client 시간(10시)을 받고 server에 (10시, +9:00) 표기
* timestamp with local time zone  (10시, +9:00)을 표기하지않고, 현지 시간 계산해서 9시
* interval year(3) to month   기간명시 날짜타입 (자리수3, 기본값자리수:2)
* interval day(3) to second   기간명시 날짜타입

In [26]:
df = pd.read_sql("""
                 SELECT SYSDATE,
                        SYSTIMESTAMP,
                        CURRENT_DATE,
                        CURRENT_TIMESTAMP,
                        LOCALTIMESTAMP
                FROM dual
                """,xedb)
print(df)

              SYSDATE            SYSTIMESTAMP        CURRENT_DATE  \
0 2017-11-13 11:47:40 2017-11-13 11:47:40.029 2017-11-13 11:47:40

    CURRENT_TIMESTAMP      LOCALTIMESTAMP
0 2017-11-13 11:47:40 2017-11-13 11:47:40

In [29]:
df = pd.read_sql("""
                 SELECT LOCALTIMESTAMP,
                        EXTRACT(HOUR FROM LOCALTIMESTAMP) hr,
                        EXTRACT(MINUTE FROM LOCALTIMESTAMP) min,
                        EXTRACT(SECOND FROM LOCALTIMESTAMP) sec
                FROM dual
                """,xedb)
print(df)

           LOCALTIMESTAMP  HR  MIN     SEC
0 2017-11-13 11:50:19.377  11   50  19.377

In [30]:
df = pd.read_sql("""
                 SELECT SYSTIMESTAMP, 
                        CURRENT_TIMESTAMP,
                        EXTRACT(TIMEZONE_HOUR FROM SYSTIMESTAMP)sys_z_hr,
                        EXTRACT(TIMEZONE_MINUTE FROM SYSTIMESTAMP)sys_z_min,
                        EXTRACT(TIMEZONE_REGION FROM CURRENT_TIMESTAMP)crr_z_rgn,
                        EXTRACT(TIMEZONE_ABBR FROM CURRENT_TIMESTAMP) crr_z_abbr
                FROM dual
                """,xedb)
print(df)

             SYSTIMESTAMP       CURRENT_TIMESTAMP  SYS_Z_HR  SYS_Z_MIN  \
0 2017-11-13 11:50:47.152 2017-11-13 11:50:47.152         9          0

  CRR_Z_RGN CRR_Z_ABBR
0   UNKNOWN        UNK

### < TO_TIMESTAMP, TO_YMINTERVAL, TO_DSINTERVAL >

In [31]:
df = pd.read_sql("""
                 SELECT SYSDATE,
                         to_char(SYSDATE + to_dsinterval('50 10:00:00'),'yyyy-mm-dd hh24:mi:ss') to_char_dsinterval
                FROM dual
                """,xedb)
print(df)

              SYSDATE   TO_CHAR_DSINTERVAL
0 2017-11-13 11:51:02  2018-01-02 21:51:02

In [32]:
df = pd.read_sql("""
                 SELECT hire_date, hire_date + to_yminterval('02-00') AS hire_date_ymininterval
                 FROM employees
                 WHERE salary>10000
                 """,xedb)
print(df)

    HIRE_DATE HIRE_DATE_YMININTERVAL
0  2003-06-17             2005-06-17
1  2005-09-21             2007-09-21
2  2001-01-13             2003-01-13
3  2002-08-17             2004-08-17
4  2002-12-07             2004-12-07
5  2004-10-01             2006-10-01
6  2005-01-05             2007-01-05
7  2005-03-10             2007-03-10
8  2007-10-15             2009-10-15
9  2008-01-29             2010-01-29
10 2005-11-11             2007-11-11
11 2005-03-11             2007-03-11
12 2004-05-11             2006-05-11
13 2004-02-17             2006-02-17
14 2002-06-07             2004-06-07

In [33]:
df = pd.read_sql("""
                 SELECT last_name, hire_date,
                        to_char(hire_date, 'mm-dd-yy:hh:mi:ss') to_char_hire_date,
                        to_char(hire_date + to_dsinterval('100 10:00:00.123456789'),'mm-dd-yy:hh:mi:ss') dsinterval_hire_date
                FROM employees
                WHERE salary>10000
                """,xedb)
print(df)

    LAST_NAME  HIRE_DATE  TO_CHAR_HIRE_DATE DSINTERVAL_HIRE_DATE
0        King 2003-06-17  06-17-03:12:00:00    09-25-03:10:00:00
1     Kochhar 2005-09-21  09-21-05:12:00:00    12-30-05:10:00:00
2     De Haan 2001-01-13  01-13-01:12:00:00    04-23-01:10:00:00
3   Greenberg 2002-08-17  08-17-02:12:00:00    11-25-02:10:00:00
4    Raphaely 2002-12-07  12-07-02:12:00:00    03-17-03:10:00:00
5     Russell 2004-10-01  10-01-04:12:00:00    01-09-05:10:00:00
6    Partners 2005-01-05  01-05-05:12:00:00    04-15-05:10:00:00
7   Errazuriz 2005-03-10  03-10-05:12:00:00    06-18-05:10:00:00
8   Cambrault 2007-10-15  10-15-07:12:00:00    01-23-08:10:00:00
9     Zlotkey 2008-01-29  01-29-08:12:00:00    05-08-08:10:00:00
10    Vishney 2005-11-11  11-11-05:12:00:00    02-19-06:10:00:00
11       Ozer 2005-03-11  03-11-05:12:00:00    06-19-05:10:00:00
12       Abel 2004-05-11  05-11-04:12:00:00    08-19-04:10:00:00
13  Hartstein 2004-02-17  02-17-04:12:00:00    05-27-04:10:00:00
14    Higgins 2002-06-07  06-07-02:12:00:00    09-15-02:10:00:00

### 2-5 NULL 관련 함수
###  NVL(a,b) 
* a가 null이 아니면 a출력/ null이면, b값
* 두 개 인수 형일치 필요

###  NVL2(a,b,c)
* a가 null이 아니면 b / null이면 c

### COALESCE (a,b,c,,,)
* a가 null이 아니면 a출력 / null이면 b 체크
* b가 null이 아니면 b출력
* 인수개수 제한 x  

### NULLIF(a,b) 
* NULL을 만드는 함수
* a,b같으면 null / 다르면 a

In [34]:
df = pd.read_sql("""
                SELECT commission_pct,salary,
                        nvl(commission_pct, 0),
                        (salary*12)+(salary*12*nvl(commission_pct, 0)) nvl_sal
                FROM employees
                WHERE salary>10000
                """,xedb)
print(df)

    COMMISSION_PCT   SALARY  NVL(COMMISSION_PCT,0)  NVL_SAL
0              NaN  24000.0                   0.00   288000
1              NaN  17000.0                   0.00   204000
2              NaN  17000.0                   0.00   204000
3              NaN  12008.0                   0.00   144096
4              NaN  11000.0                   0.00   132000
5             0.40  14000.0                   0.40   235200
6             0.30  13500.0                   0.30   210600
7             0.30  12000.0                   0.30   187200
8             0.30  11000.0                   0.30   171600
9             0.20  10500.0                   0.20   151200
10            0.25  10500.0                   0.25   157500
11            0.25  11500.0                   0.25   172500
12            0.30  11000.0                   0.30   171600
13             NaN  13000.0                   0.00   156000
14             NaN  12008.0                   0.00   144096

In [35]:
df = pd.read_sql("""
                 SELECT commission_pct,
                        nvl2(commission_pct, (salary*12)+(salary*12*commission_pct), salary*12) nvl2_sal,
                        COALESCE((salary+(commission_pct*salary)), salary+2000, salary) coal_sal,
                        nullif(LENGTH(first_name), LENGTH(last_name)) null_if
                FROM employees
                WHERE salary>10000
                """,xedb)
print(df)

    COMMISSION_PCT  NVL2_SAL  COAL_SAL  NULL_IF
0              NaN    288000     26000      6.0
1              NaN    204000     19000      5.0
2              NaN    204000     19000      3.0
3              NaN    144096     14008      5.0
4              NaN    132000     13000      3.0
5             0.40    235200     19600      4.0
6             0.30    210600     17550      5.0
7             0.30    187200     15600      7.0
8             0.30    171600     14300      6.0
9             0.20    151200     12600      5.0
10            0.25    157500     13125      5.0
11            0.25    172500     14375      NaN
12            0.30    171600     14300      5.0
13             NaN    156000     15000      7.0
14             NaN    144096     14008      NaN

### 2-6 조건부 함수와 표현식

### < DECODE >

* job id = IT PROG 이면 1.10xsalary 반환
* job id = 'ST CLERK' 이면, 1.15xsalary 반환
* job id = 'SA REP' 이면, 1.20xsalary 반환 
* 조건에 없으면 salary 반환

In [36]:
df = pd.read_sql("""
        SELECT last_name, job_id, salary,
                DECODE (job_id, 'IT_PROG', 1.10*salary,
                                'ST_CLERK', 1.15*salary,
                                'SA_REP', 1.20*salary,
                        salary) rivised_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   JOB_ID   SALARY  RIVISED_SAL
0        King  AD_PRES  24000.0        24000
1     Kochhar    AD_VP  17000.0        17000
2     De Haan    AD_VP  17000.0        17000
3   Greenberg   FI_MGR  12008.0        12008
4    Raphaely   PU_MAN  11000.0        11000
5     Russell   SA_MAN  14000.0        14000
6    Partners   SA_MAN  13500.0        13500
7   Errazuriz   SA_MAN  12000.0        12000
8   Cambrault   SA_MAN  11000.0        11000
9     Zlotkey   SA_MAN  10500.0        10500
10    Vishney   SA_REP  10500.0        12600
11       Ozer   SA_REP  11500.0        13800
12       Abel   SA_REP  11000.0        13200
13  Hartstein   MK_MAN  13000.0        13000
14    Higgins   AC_MGR  12008.0        12008

### < CASE.. WHEN >

In [37]:
df = pd.read_sql("""
        SELECT last_name, job_id, salary,
                CASE job_id\
                    WHEN 'IT_PROG' THEN 1.10*salary
                    WHEN 'ST_CLERK' THEN 1.15*salary
                    WHEN 'SA_REP' THEN 1.20*salary
                    ELSE salary
                END revised_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   JOB_ID   SALARY  REVISED_SAL
0        King  AD_PRES  24000.0        24000
1     Kochhar    AD_VP  17000.0        17000
2     De Haan    AD_VP  17000.0        17000
3   Greenberg   FI_MGR  12008.0        12008
4    Raphaely   PU_MAN  11000.0        11000
5     Russell   SA_MAN  14000.0        14000
6    Partners   SA_MAN  13500.0        13500
7   Errazuriz   SA_MAN  12000.0        12000
8   Cambrault   SA_MAN  11000.0        11000
9     Zlotkey   SA_MAN  10500.0        10500
10    Vishney   SA_REP  10500.0        12600
11       Ozer   SA_REP  11500.0        13800
12       Abel   SA_REP  11000.0        13200
13  Hartstein   MK_MAN  13000.0        13000
14    Higgins   AC_MGR  12008.0        12008

In [43]:
df = pd.read_sql_query(
        "SELECT last_name, salary,\
                CASE WHEN salary<5000 THEN 'Low'\
                    WHEN salary<10000 THEN 'Medium'\
                    WHEN salary<20000 THEN 'Good'\
                    ELSE 'Excellent'\
                END qualified_sal\
        FROM employees\
        WHERE department_id=80",xedb)
print(df)

     LAST_NAME   SALARY QUALIFIED_SAL
0      Russell  14000.0          Good
1     Partners  13500.0          Good
2    Errazuriz  12000.0          Good
3    Cambrault  11000.0          Good
4      Zlotkey  10500.0          Good
5       Tucker  10000.0          Good
6    Bernstein   9500.0        Medium
7         Hall   9000.0        Medium
8        Olsen   8000.0        Medium
9    Cambrault   7500.0        Medium
10     Tuvault   7000.0        Medium
11        King  10000.0          Good
12       Sully   9500.0        Medium
13      McEwen   9000.0        Medium
14       Smith   8000.0        Medium
15       Doran   7500.0        Medium
16      Sewall   7000.0        Medium
17     Vishney  10500.0          Good
18      Greene   9500.0        Medium
19     Marvins   7200.0        Medium
20         Lee   6800.0        Medium
21        Ande   6400.0        Medium
22       Banda   6200.0        Medium
23        Ozer  11500.0          Good
24       Bloom  10000.0          Good
25         Fox   9600.0        Medium
26       Smith   7400.0        Medium
27       Bates   7300.0        Medium
28       Kumar   6100.0        Medium
29        Abel  11000.0          Good
30      Hutton   8800.0        Medium
31      Taylor   8600.0        Medium
32  Livingston   8400.0        Medium
33     Johnson   6200.0        Medium

***
## [ 더 연습문제 ]
***

#### (1) employees 테이블에서 부서코드 50번 사원들 중에 last_name의 두번째 철자가 'a'인 사원을 조회하세요.

In [38]:
df = pd.read_sql("""
        SELECT *
        FROM employees
        WHERE department_id=50
        AND last_name LIKE '_a%'
        """,xedb)
print(df)

    EMPLOYEE_ID FIRST_NAME LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0           122      Payam  Kaufling  PKAUFLIN  650.123.3234 2003-05-01
1           125      Julia     Nayer    JNAYER  650.124.1214 2005-07-16
2           127      James    Landry   JLANDRY  650.124.1334 2007-01-14
3           128     Steven    Markle   SMARKLE  650.124.1434 2008-03-08
4           131      James    Marlow   JAMRLOW  650.124.7234 2005-02-16
5           133      Jason    Mallin   JMALLIN  650.127.1934 2004-06-14
6           137     Renske    Ladwig   RLADWIG  650.121.1234 2003-07-14
7           140     Joshua     Patel    JPATEL  650.121.1834 2006-04-06
8           141     Trenna      Rajs     TRAJS  650.121.8009 2003-10-17
9           142     Curtis    Davies   CDAVIES  650.121.2994 2005-01-29
10          143    Randall     Matos    RMATOS  650.121.2874 2006-03-15
11          144      Peter    Vargas   PVARGAS  650.121.2004 2006-07-09
12          180    Winston    Taylor   WTAYLOR  650.507.9876 2006-01-24
13          184    Nandita  Sarchand  NSARCHAN  650.509.1876 2004-01-27
14          187    Anthony    Cabrio   ACABRIO  650.509.4876 2007-02-07
15          190    Timothy     Gates    TGATES  650.505.3876 2006-07-11
16          196      Alana     Walsh    AWALSH  650.507.9811 2006-04-24

      JOB_ID  SALARY COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
0     ST_MAN  7900.0           None         100             50
1   ST_CLERK  3200.0           None         120             50
2   ST_CLERK  2400.0           None         120             50
3   ST_CLERK  2200.0           None         120             50
4   ST_CLERK  2500.0           None         121             50
5   ST_CLERK  3300.0           None         122             50
6   ST_CLERK  3600.0           None         123             50
7   ST_CLERK  2500.0           None         123             50
8   ST_CLERK  3500.0           None         124             50
9   ST_CLERK  3100.0           None         124             50
10  ST_CLERK  2600.0           None         124             50
11  ST_CLERK  2500.0           None         124             50
12  SH_CLERK  3200.0           None         120             50
13  SH_CLERK  4200.0           None         121             50
14  SH_CLERK  3000.0           None         121             50
15  SH_CLERK  2900.0           None         122             50
16  SH_CLERK  3100.0           None         124             50

In [39]:
df = pd.read_sql("""
        SELECT *
        FROM employees
        WHERE department_id=50
        AND substr(last_name,2,1)='a'
        """,xedb)
print(df)

    EMPLOYEE_ID FIRST_NAME LAST_NAME     EMAIL  PHONE_NUMBER  HIRE_DATE  \
0           122      Payam  Kaufling  PKAUFLIN  650.123.3234 2003-05-01
1           125      Julia     Nayer    JNAYER  650.124.1214 2005-07-16
2           127      James    Landry   JLANDRY  650.124.1334 2007-01-14
3           128     Steven    Markle   SMARKLE  650.124.1434 2008-03-08
4           131      James    Marlow   JAMRLOW  650.124.7234 2005-02-16
5           133      Jason    Mallin   JMALLIN  650.127.1934 2004-06-14
6           137     Renske    Ladwig   RLADWIG  650.121.1234 2003-07-14
7           140     Joshua     Patel    JPATEL  650.121.1834 2006-04-06
8           141     Trenna      Rajs     TRAJS  650.121.8009 2003-10-17
9           142     Curtis    Davies   CDAVIES  650.121.2994 2005-01-29
10          143    Randall     Matos    RMATOS  650.121.2874 2006-03-15
11          144      Peter    Vargas   PVARGAS  650.121.2004 2006-07-09
12          180    Winston    Taylor   WTAYLOR  650.507.9876 2006-01-24
13          184    Nandita  Sarchand  NSARCHAN  650.509.1876 2004-01-27
14          187    Anthony    Cabrio   ACABRIO  650.509.4876 2007-02-07
15          190    Timothy     Gates    TGATES  650.505.3876 2006-07-11
16          196      Alana     Walsh    AWALSH  650.507.9811 2006-04-24

      JOB_ID  SALARY COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
0     ST_MAN  7900.0           None         100             50
1   ST_CLERK  3200.0           None         120             50
2   ST_CLERK  2400.0           None         120             50
3   ST_CLERK  2200.0           None         120             50
4   ST_CLERK  2500.0           None         121             50
5   ST_CLERK  3300.0           None         122             50
6   ST_CLERK  3600.0           None         123             50
7   ST_CLERK  2500.0           None         123             50
8   ST_CLERK  3500.0           None         124             50
9   ST_CLERK  3100.0           None         124             50
10  ST_CLERK  2600.0           None         124             50
11  ST_CLERK  2500.0           None         124             50
12  SH_CLERK  3200.0           None         120             50
13  SH_CLERK  4200.0           None         121             50
14  SH_CLERK  3000.0           None         121             50
15  SH_CLERK  2900.0           None         122             50
16  SH_CLERK  3100.0           None         124             50

#### (2) employees 테이블에서 job_id가 'ST_CLERK'이면서2005년도 이전에 입사한 사원들의 정보를 조회하세요.

In [40]:
df = pd.read_sql("""
        SELECT *
        FROM employees
        WHERE job_id='ST_CLERK'
        AND hire_date < to_date('2005-01-01','YYYY-MM-DD')
        """,xedb)
print(df)

   EMPLOYEE_ID FIRST_NAME LAST_NAME    EMAIL  PHONE_NUMBER  HIRE_DATE  \
0          133      Jason    Mallin  JMALLIN  650.127.1934 2004-06-14
1          137     Renske    Ladwig  RLADWIG  650.121.1234 2003-07-14
2          141     Trenna      Rajs    TRAJS  650.121.8009 2003-10-17

     JOB_ID  SALARY COMMISSION_PCT  MANAGER_ID  DEPARTMENT_ID
0  ST_CLERK  3300.0           None         122             50
1  ST_CLERK  3600.0           None         123             50
2  ST_CLERK  3500.0           None         124             50

#### (3) 급여가 10000 이상인 사원의 last_name, hire_date 및 근무 6개월 후 첫번째 월요일에 해당하는 급여 협상날짜를 표시합니다.

In [41]:
df = pd.read_sql("""
        SELECT last_name, hire_date,
                TO_CHAR(NEXT_DAY(ADD_MONTHS(hire_date, 6),'월요일'),'DD, Ddspth MM, YYYY') REVIEW
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME  HIRE_DATE                       REVIEW
0        King 2003-06-17   22, Twenty-Second 12, 2003
1     Kochhar 2005-09-21  27, Twenty-Seventh 03, 2006
2     De Haan 2001-01-13       16, Sixteenth 07, 2001
3   Greenberg 2002-08-17   24, Twenty-Fourth 02, 2003
4    Raphaely 2002-12-07           09, Ninth 06, 2003
5     Russell 2004-10-01          04, Fourth 04, 2005
6    Partners 2005-01-05        11, Eleventh 07, 2005
7   Errazuriz 2005-03-10         12, Twelfth 09, 2005
8   Cambrault 2007-10-15    21, Twenty-First 04, 2008
9     Zlotkey 2008-01-29          04, Fourth 08, 2008
10    Vishney 2005-11-11       15, Fifteenth 05, 2006
11       Ozer 2005-03-11         12, Twelfth 09, 2005
12       Abel 2004-05-11       15, Fifteenth 11, 2004
13  Hartstein 2004-02-17    23, Twenty-Third 08, 2004
14    Higgins 2002-06-07           09, Ninth 12, 2002

#### (4) 사원테이블에서 last_name, salary, commission_pct을 조회하고 최종연봉을 계산한 컬럼(ann_sal)을 추가하세요 
(힌트 : commission_pct이 존재하면 (salary*12) + (salary*12*commission_pct)이 수행되고, null이면 salary * 12)

#### NVL

In [42]:
df = pd.read_sql("""
        SELECT last_name, salary, commission_pct,
                (salary*12)+(salary*12 * NVL(commission_pct,0)) ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

#### NVL2

In [43]:
df = pd.read_sql("""
        SELECT last_name, salary, commission_pct,
                NVL2(commission_pct,(salary*12) + (salary*12*commission_pct), salary*12) ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

#### COALESCE

In [44]:
df = pd.read_sql("""
        SELECT last_name, salary, commission_pct,
                COALESCE((salary*12) + (salary*12*commission_pct), salary*12)ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

#### DECODE

In [45]:
df = pd.read_sql("""
        SELECT last_name, salary,commission_pct,
                decode(commission_pct, null, salary*12, (salary*12) + (salary*12*commission_pct)) ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

#### CASE

In [46]:
df = pd.read_sql("""
        SELECT last_name, salary, commission_pct,
                CASE WHEN commission_pct IS NULL THEN salary*12
                    ELSE (salary*12) + (salary*12*commission_pct)
                END ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

In [47]:
df = pd.read_sql("""
        SELECT last_name, salary, commission_pct,
                CASE WHEN commission_pct IS NOT NULL THEN (salary*12) + (salary*12*commission_pct)
                    ELSE salary * 12
                END ann_sal
        FROM employees
        WHERE salary>10000
        """,xedb)
print(df)

    LAST_NAME   SALARY  COMMISSION_PCT  ANN_SAL
0        King  24000.0             NaN   288000
1     Kochhar  17000.0             NaN   204000
2     De Haan  17000.0             NaN   204000
3   Greenberg  12008.0             NaN   144096
4    Raphaely  11000.0             NaN   132000
5     Russell  14000.0            0.40   235200
6    Partners  13500.0            0.30   210600
7   Errazuriz  12000.0            0.30   187200
8   Cambrault  11000.0            0.30   171600
9     Zlotkey  10500.0            0.20   151200
10    Vishney  10500.0            0.25   157500
11       Ozer  11500.0            0.25   172500
12       Abel  11000.0            0.30   171600
13  Hartstein  13000.0             NaN   156000
14    Higgins  12008.0             NaN   144096

In [ ]:
cur.close()
xedb.close()